MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i2c.h
/** @defgroup I2C_LL_EF_Configuration Configuration
  * @{
  */

/**
  * @brief  Enable I2C peripheral (PE = 1).
  * @rmtoll
  *  CR1          PE            LL_I2C_Enable
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_Enable(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_PE);
}

/**
  * @brief  Disable I2C peripheral (PE = 0).
  * @param  p_i2c I2C instance.
  * @note   When PE = 0, the I2C SCL and SDA lines are released.
  *         Internal state machines and status bits are put back to their reset value.
  *         When cleared, PE must be kept low for at least 3 APB clock cycles.
  * @rmtoll
  *  CR1          PE            LL_I2C_Disable
  */
__STATIC_INLINE void LL_I2C_Disable(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_PE);
}

/**
  * @brief  Check if the I2C peripheral is enabled or disabled.
  * @rmtoll
  *  CR1          PE            LL_I2C_IsEnabled
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabled(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_PE) == (I2C_CR1_PE)) ? 1UL : 0UL);
}

/**
  * @brief  Configure Noise Filters (Analog and Digital).
  * @param  p_i2c I2C instance.
  * @param  analog_filter This parameter can be one of the following values:
  *         @arg @ref LL_I2C_ANALOGFILTER_ENABLE
  *         @arg @ref LL_I2C_ANALOGFILTER_DISABLE
  * @param  digital_filter This parameter must be a value between Min_Data=0x00 (Digital filter disabled)
            and Max_Data=0x0F (Digital filter enabled and filtering capability up to 15*ti2cclk).
  *         This parameter is used to configure the digital noise filter on SDA and SCL input.
  *         The digital filter filters spikes with a length of up to DNF[3:0]*ti2cclk.
  * @note   If the analog filter is also enabled, the digital filter is added to analog filter.
  *         The filters can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll
  *  CR1          ANFOFF        LL_I2C_ConfigFilters \n
  *  CR1          DNF           LL_I2C_ConfigFilters
  */
__STATIC_INLINE void LL_I2C_ConfigFilters(I2C_TypeDef *p_i2c, uint32_t analog_filter, uint32_t digital_filter)
{
  STM32_MODIFY_REG(p_i2c->CR1, I2C_CR1_ANFOFF | I2C_CR1_DNF, analog_filter | (digital_filter << I2C_CR1_DNF_Pos));
}

/**
  * @brief  Configure Digital Noise Filter.
  * @param  p_i2c I2C instance.
  * @param  digital_filter This parameter must be a value between Min_Data=0x00 (Digital filter disabled)
            and Max_Data=0x0F (Digital filter enabled and filtering capability up to 15*ti2cclk).
  *         This parameter is used to configure the digital noise filter on SDA and SCL input.
  *         The digital filter filters spikes with a length of up to DNF[3:0]*ti2cclk.
  * @note   If the analog filter is also enabled, the digital filter is added to analog filter.
  *         This filter can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll
  *  CR1          DNF           LL_I2C_SetDigitalFilter
  */
__STATIC_INLINE void LL_I2C_SetDigitalFilter(I2C_TypeDef *p_i2c, uint32_t digital_filter)
{
  STM32_MODIFY_REG(p_i2c->CR1, I2C_CR1_DNF, digital_filter << I2C_CR1_DNF_Pos);
}

/**
  * @brief  Get the current Digital Noise Filter configuration.
  * @rmtoll
  *  CR1          DNF           LL_I2C_GetDigitalFilter
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0xF
  */
__STATIC_INLINE uint32_t LL_I2C_GetDigitalFilter(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->CR1, I2C_CR1_DNF) >> I2C_CR1_DNF_Pos);
}

/**
  * @brief  Enable Analog Noise Filter.
  * @param  p_i2c I2C instance.
  * @note   This filter can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll
  *  CR1          ANFOFF        LL_I2C_EnableAnalogFilter
  */
__STATIC_INLINE void LL_I2C_EnableAnalogFilter(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_ANFOFF);
}

/**
  * @brief  Disable Analog Noise Filter.
  * @param  p_i2c I2C instance.
  * @note   This filter can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll
  *  CR1          ANFOFF        LL_I2C_DisableAnalogFilter
  */
__STATIC_INLINE void LL_I2C_DisableAnalogFilter(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_ANFOFF);
}

/**
  * @brief  Check if Analog Noise Filter is enabled or disabled.
  * @rmtoll
  *  CR1          ANFOFF        LL_I2C_IsEnabledAnalogFilter
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledAnalogFilter(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_ANFOFF) != (I2C_CR1_ANFOFF)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA transmission requests.
  * @rmtoll
  *  CR1          TXDMAEN       LL_I2C_EnableDMAReq_TX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableDMAReq_TX(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_TXDMAEN);
}

/**
  * @brief  Disable DMA transmission requests.
  * @rmtoll
  *  CR1          TXDMAEN       LL_I2C_DisableDMAReq_TX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableDMAReq_TX(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_TXDMAEN);
}

/**
  * @brief  Check if DMA transmission requests are enabled or disabled.
  * @rmtoll
  *  CR1          TXDMAEN       LL_I2C_IsEnabledDMAReq_TX
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledDMAReq_TX(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_TXDMAEN) == (I2C_CR1_TXDMAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA reception requests.
  * @rmtoll
  *  CR1          RXDMAEN       LL_I2C_EnableDMAReq_RX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableDMAReq_RX(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_RXDMAEN);
}

/**
  * @brief  Disable DMA reception requests.
  * @rmtoll
  *  CR1          RXDMAEN       LL_I2C_DisableDMAReq_RX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableDMAReq_RX(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_RXDMAEN);
}

/**
  * @brief  Check if DMA reception requests are enabled or disabled.
  * @rmtoll
  *  CR1          RXDMAEN       LL_I2C_IsEnabledDMAReq_RX
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledDMAReq_RX(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_RXDMAEN) == (I2C_CR1_RXDMAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Get the data register address used for DMA transfer.
  * @rmtoll
  *  TXDR         TXDATA        LL_I2C_DMA_GetRegAddr \n
  *  RXDR         RXDATA        LL_I2C_DMA_GetRegAddr
  * @param  p_i2c I2C instance
  * @param  direction This parameter can be one of the following values:
  *         @arg @ref LL_I2C_DMA_REG_DATA_TRANSMIT
  *         @arg @ref LL_I2C_DMA_REG_DATA_RECEIVE
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_I2C_DMA_GetRegAddr(const I2C_TypeDef *p_i2c, uint32_t direction)
{
  uint32_t data_reg_addr;

  if (direction == LL_I2C_DMA_REG_DATA_TRANSMIT)
  {
    /* return address of TXDR register */
    data_reg_addr = (uint32_t) &(p_i2c->TXDR);
  }
  else
  {
    /* return address of RXDR register */
    data_reg_addr = (uint32_t) &(p_i2c->RXDR);
  }

  return data_reg_addr;
}

/**
  * @brief  Get the tx data register address used for DMA transfer.
  * @rmtoll
  *  TXDR         TXDATA        LL_I2C_DMA_GetRegAddrTx
  * @param  p_i2c I2C instance
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_I2C_DMA_GetRegAddrTx(const I2C_TypeDef *p_i2c)
{
  return (uint32_t) &(p_i2c->TXDR);
}

/**
  * @brief  Get the rx data register address used for DMA transfer.
  * @rmtoll
  *  RXDR         RXDATA        LL_I2C_DMA_GetRegAddrRx
  * @param  p_i2c I2C instance
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_I2C_DMA_GetRegAddrRx(const I2C_TypeDef *p_i2c)
{
  return (uint32_t) &(p_i2c->RXDR);
}

/**
  * @brief  Enable Clock stretching.
  * @param  p_i2c I2C instance.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll
  *  CR1          NOSTRETCH     LL_I2C_EnableClockStretching
  */
__STATIC_INLINE void LL_I2C_EnableClockStretching(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_NOSTRETCH);
}

/**
  * @brief  Disable Clock stretching.
  * @param  p_i2c I2C instance.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll
  *  CR1          NOSTRETCH     LL_I2C_DisableClockStretching
  */
__STATIC_INLINE void LL_I2C_DisableClockStretching(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_NOSTRETCH);
}

/**
  * @brief  Check if Clock stretching is enabled or disabled.
  * @rmtoll
  *  CR1          NOSTRETCH     LL_I2C_IsEnabledClockStretching
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledClockStretching(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_NOSTRETCH) != (I2C_CR1_NOSTRETCH)) ? 1UL : 0UL);
}

/**
  * @brief  Enable hardware byte control in slave mode.
  * @rmtoll
  *  CR1          SBC           LL_I2C_EnableSlaveByteControl
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableSlaveByteControl(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_SBC);
}

/**
  * @brief  Disable hardware byte control in slave mode.
  * @rmtoll
  *  CR1          SBC           LL_I2C_DisableSlaveByteControl
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableSlaveByteControl(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_SBC);
}

/**
  * @brief  Check if hardware byte control in slave mode is enabled or disabled.
  * @rmtoll
  *  CR1          SBC           LL_I2C_IsEnabledSlaveByteControl
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledSlaveByteControl(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_SBC) == (I2C_CR1_SBC)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Wakeup from STOP.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_I2C_WAKEUP_FROMSTOP_INSTANCE(p_i2c) can be used to check whether or not
  *         WakeUpFromStop feature is supported by the p_i2c instance.
  * @note   This bit can only be programmed when Digital Filter is disabled.
  * @rmtoll
  *  CR1          WUPEN         LL_I2C_EnableWakeUpFromStop
  */
__STATIC_INLINE void LL_I2C_EnableWakeUpFromStop(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_WUPEN);
}

/**
  * @brief  Disable Wakeup from STOP.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_I2C_WAKEUP_FROMSTOP_INSTANCE(p_i2c) can be used to check whether or not
  *         WakeUpFromStop feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          WUPEN         LL_I2C_DisableWakeUpFromStop
  */
__STATIC_INLINE void LL_I2C_DisableWakeUpFromStop(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_WUPEN);
}

/**
  * @brief  Check if Wakeup from STOP is enabled or disabled.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_I2C_WAKEUP_FROMSTOP_INSTANCE(p_i2c) can be used to check whether or not
  *         WakeUpFromStop feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          WUPEN         LL_I2C_IsEnabledWakeUpFromStop
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledWakeUpFromStop(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_WUPEN) == (I2C_CR1_WUPEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable General Call.
  * @param  p_i2c I2C instance.
  * @note   When enabled the Address 0x00 is ACKed.
  * @rmtoll
  *  CR1          GCEN          LL_I2C_EnableGeneralCall
  */
__STATIC_INLINE void LL_I2C_EnableGeneralCall(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_GCEN);
}

/**
  * @brief  Disable General Call.
  * @param  p_i2c I2C instance.
  * @note   When disabled the Address 0x00 is NACKed.
  * @rmtoll
  *  CR1          GCEN          LL_I2C_DisableGeneralCall
  */
__STATIC_INLINE void LL_I2C_DisableGeneralCall(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_GCEN);
}

/**
  * @brief  Check if General Call is enabled or disabled.
  * @param  p_i2c I2C instance.
  * @rmtoll
  *  CR1          GCEN          LL_I2C_IsEnabledGeneralCall
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledGeneralCall(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_GCEN) == (I2C_CR1_GCEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable I2C Fast Mode Plus (FMP = 1).
  * @param  p_i2c I2C instance.
  * @note   20mA I/O drive enable
  * @rmtoll
  *  CR1          FMP           LL_I2C_EnableFastModePlus
  */
__STATIC_INLINE void LL_I2C_EnableFastModePlus(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_FMP);
}

/**
  * @brief  Disable I2C Fast Mode Plus (FMP = 0).
  * @param  p_i2c I2C instance.
  * @note   20mA I/O drive disable
  * @rmtoll
  *  CR1          FMP           LL_I2C_DisableFastModePlus
  */
__STATIC_INLINE void LL_I2C_DisableFastModePlus(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_FMP);
}

/**
  * @brief  Check if the I2C Fast Mode Plus is enabled or disabled.
  * @rmtoll
  *  CR1          FMP           LL_I2C_IsEnabledFastModePlus
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledFastModePlus(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_FMP) == (I2C_CR1_FMP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable automatic clear of ADDR flag.
  * @rmtoll
  *  CR1          ADDRACLR      LL_I2C_EnableAutoClearFlag_ADDR
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableAutoClearFlag_ADDR(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_ADDRACLR);
}

/**
  * @brief  Disable automatic clear of ADDR flag.
  * @rmtoll
  *  CR1          ADDRACLR      LL_I2C_DisableAutoClearFlag_ADDR
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableAutoClearFlag_ADDR(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_ADDRACLR);
}

/**
  * @brief  Check if the automatic clear of ADDR flag is enabled or disabled.
  * @rmtoll
  *  CR1          ADDRACLR      LL_I2C_IsEnabledAutoClearFlag_ADDR
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledAutoClearFlag_ADDR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_ADDRACLR) == (I2C_CR1_ADDRACLR)) ? 1UL : 0UL);
}

/**
  * @brief  Enable automatic clear of STOP flag.
  * @rmtoll
  *  CR1          STOPFACLR     LL_I2C_EnableAutoClearFlag_STOP
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableAutoClearFlag_STOP(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_STOPFACLR);
}

/**
  * @brief  Disable automatic clear of STOP flag.
  * @rmtoll
  *  CR1          STOPFACLR     LL_I2C_DisableAutoClearFlag_STOP
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableAutoClearFlag_STOP(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_STOPFACLR);
}

/**
  * @brief  Check if the automatic clear of STOP flag is enabled or disabled.
  * @rmtoll
  *  CR1          STOPFACLR     LL_I2C_IsEnabledAutoClearFlag_STOP
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledAutoClearFlag_STOP(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_STOPFACLR) == (I2C_CR1_STOPFACLR)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the Master to operate in 7-bit or 10-bit addressing mode.
  * @param  p_i2c I2C instance.
  * @param  addressing_mode This parameter can be one of the following values:
  *         @arg @ref LL_I2C_ADDRESSING_MODE_7BIT
  *         @arg @ref LL_I2C_ADDRESSING_MODE_10BIT
  * @note   Changing this bit is not allowed, when the START bit is set.
  * @rmtoll
  *  CR2          ADD10         LL_I2C_SetMasterAddressingMode
  */
__STATIC_INLINE void LL_I2C_SetMasterAddressingMode(I2C_TypeDef *p_i2c, uint32_t addressing_mode)
{
  STM32_MODIFY_REG(p_i2c->CR2, I2C_CR2_ADD10, addressing_mode);
}

/**
  * @brief  Get the Master addressing mode.
  * @rmtoll
  *  CR2          ADD10         LL_I2C_GetMasterAddressingMode
  * @param  p_i2c I2C instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_ADDRESSING_MODE_7BIT
  *         @arg @ref LL_I2C_ADDRESSING_MODE_10BIT
  */
__STATIC_INLINE uint32_t LL_I2C_GetMasterAddressingMode(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->CR2, I2C_CR2_ADD10));
}

/**
  * @brief  Set the Own Address1.
  * @rmtoll
  *  OAR1         OA1           LL_I2C_SetOwnAddress1 \n
  *  OAR1         OA1MODE       LL_I2C_SetOwnAddress1
  * @param  p_i2c I2C instance.
  * @param  own_address1 This parameter must be a value between Min_Data=0 and Max_Data=0x3FF.
  * @param  own_addr_size This parameter can be one of the following values:
  *         @arg @ref LL_I2C_OWNADDRESS1_7BIT
  *         @arg @ref LL_I2C_OWNADDRESS1_10BIT
  */
__STATIC_INLINE void LL_I2C_SetOwnAddress1(I2C_TypeDef *p_i2c, uint32_t own_address1, uint32_t own_addr_size)
{
  STM32_MODIFY_REG(p_i2c->OAR1, I2C_OAR1_OA1 | I2C_OAR1_OA1MODE, own_address1 | own_addr_size);
}

/**
  * @brief  Get the Own Address1.
  * @rmtoll
  *  OAR1         OA1           LL_I2C_SetOwnAddress1
  * @param  p_i2c I2C instance.
  * @retval Own Address1.
  */
__STATIC_INLINE uint32_t LL_I2C_GetOwnAddress1(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->OAR1, I2C_OAR1_OA1));
}

/**
  * @brief  Enable acknowledge on Own Address1 match address.
  * @rmtoll
  *  OAR1         OA1EN         LL_I2C_EnableOwnAddress1
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableOwnAddress1(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->OAR1, I2C_OAR1_OA1EN);
}

/**
  * @brief  Disable acknowledge on Own Address1 match address.
  * @rmtoll
  *  OAR1         OA1EN         LL_I2C_DisableOwnAddress1
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableOwnAddress1(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->OAR1, I2C_OAR1_OA1EN);
}

/**
  * @brief  Disable acknowledge on Own Address1 match address and mode.
  * @rmtoll
  *  OAR1         OA1EN         LL_I2C_DisableOwnAddress1 \n
  *  OAR1         OA1MODE       LL_I2C_DisableOwnAddress1
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableOwnAddress1AndMode(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->OAR1, I2C_OAR1_OA1EN | I2C_OAR1_OA1MODE);
}

/**
  * @brief  Check if Own Address1 acknowledge is enabled or disabled.
  * @rmtoll
  *  OAR1         OA1EN         LL_I2C_IsEnabledOwnAddress1
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledOwnAddress1(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->OAR1, I2C_OAR1_OA1EN) == (I2C_OAR1_OA1EN)) ? 1UL : 0UL);
}


/**
  * @brief  Configure Own Address1 and enable it.
  * @rmtoll
  *  OAR1         OA1           LL_I2C_ConfigOwnAddress1 \n
  *  OAR1         OA1MODE       LL_I2C_ConfigOwnAddress1 \n
  *  OAR1         OA1EN         LL_I2C_ConfigOwnAddress1
  * @param  p_i2c I2C instance.
  * @param  own_address1 This parameter must be a value between Min_Data=0 and Max_Data=0x3FF.
  * @param  own_addr_size This parameter can be one of the following values:
  *         @arg @ref LL_I2C_OWNADDRESS1_7BIT
  *         @arg @ref LL_I2C_OWNADDRESS1_10BIT
  */
__STATIC_INLINE void LL_I2C_ConfigOwnAddress1(I2C_TypeDef *p_i2c, uint32_t own_address1, uint32_t own_addr_size)
{
  STM32_WRITE_REG(p_i2c->OAR1, I2C_OAR1_OA1EN | own_address1 | own_addr_size);
}


/**
  * @brief  Set the 7-bit Own Address2.
  * @param  p_i2c I2C instance.
  * @param  own_address2 Value between Min_Data=0 and Max_Data=0x7F.
  * @param  own_addr_mask This parameter can be one of the following values:
  *         @arg @ref LL_I2C_OWNADDRESS2_NOMASK
  *         @arg @ref LL_I2C_OWNADDRESS2_MASK01
  *         @arg @ref LL_I2C_OWNADDRESS2_MASK02
  *         @arg @ref LL_I2C_OWNADDRESS2_MASK03
  *         @arg @ref LL_I2C_OWNADDRESS2_MASK04
  *         @arg @ref LL_I2C_OWNADDRESS2_MASK05
  *         @arg @ref LL_I2C_OWNADDRESS2_MASK06
  *         @arg @ref LL_I2C_OWNADDRESS2_MASK07
  * @note   This action has no effect if own address2 is enabled.
  * @rmtoll
  *  OAR2         OA2           LL_I2C_SetOwnAddress2 \n
  *  OAR2         OA2MSK        LL_I2C_SetOwnAddress2
  */
__STATIC_INLINE void LL_I2C_SetOwnAddress2(I2C_TypeDef *p_i2c, uint32_t own_address2, uint32_t own_addr_mask)
{
  STM32_MODIFY_REG(p_i2c->OAR2, I2C_OAR2_OA2 | I2C_OAR2_OA2MSK, own_address2 | own_addr_mask);
}

/**
  * @brief  Get the Own Address2.
  * @rmtoll
  *  OAR2         OA2           LL_I2C_GetOwnAddress2
  * @param  p_i2c I2C instance.
  * @retval Own Address2 value
  */
__STATIC_INLINE uint32_t LL_I2C_GetOwnAddress2(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->OAR2, I2C_OAR2_OA2) & 0xFFFFFFFEUL);
}

/**
  * @brief  Get the Own Address2 mask.
  * @rmtoll
  *  OAR2         OA2MSK          LL_I2C_GetOwnAddress2Mask
  * @param  p_i2c I2C instance.
  * @retval Own Address2 mask
  */
__STATIC_INLINE uint32_t LL_I2C_GetOwnAddress2Mask(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->OAR2, I2C_OAR2_OA2MSK));
}


/**
  * @brief  Enable acknowledge on Own Address2 match address.
  * @rmtoll
  *  OAR2         OA2EN         LL_I2C_EnableOwnAddress2
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableOwnAddress2(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->OAR2, I2C_OAR2_OA2EN);
}

/**
  * @brief  Disable  acknowledge on Own Address2 match address.
  * @rmtoll
  *  OAR2         OA2EN         LL_I2C_DisableOwnAddress2
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableOwnAddress2(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->OAR2, I2C_OAR2_OA2EN);
}

/**
  * @brief  Check if Own Address1 acknowledge is enabled or disabled.
  * @rmtoll
  *  OAR2         OA2EN         LL_I2C_IsEnabledOwnAddress2
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledOwnAddress2(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->OAR2, I2C_OAR2_OA2EN) == (I2C_OAR2_OA2EN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the SDA setup, hold time and the SCL high, low period.
  * @param  p_i2c I2C instance.
  * @param  timing This parameter must be a value between Min_Data=0 and Max_Data=0xF0FFFFFFU.
  *         This parameter is computed with the STM32CubeMX Tool. Bit 24 to 27 are reserved.
  * @note   This bit can only be programmed when the I2C is disabled (PE = 0).
  * @rmtoll
  *  TIMINGR      TIMINGR       LL_I2C_SetTiming
  */
__STATIC_INLINE void LL_I2C_SetTiming(I2C_TypeDef *p_i2c, uint32_t timing)
{
  STM32_WRITE_REG(p_i2c->TIMINGR, timing & (I2C_TIMINGR_SCLL | I2C_TIMINGR_SCLH \
                                            | I2C_TIMINGR_SDADEL | I2C_TIMINGR_SCLDEL | I2C_TIMINGR_PRESC));
}


/**
  * @brief  Get the SDA setup, hold time and the SCL high, low period.
  * @rmtoll
  *  TIMINGR      TIMINGR       LL_I2C_GetTiming
  * @param  p_i2c I2C instance.
  * @note   This parameter can be computed with the STM32CubeMX Tool.
  * @retval Value between Min_Data=0 and Max_Data=0xFFFFFFFF.
  */
__STATIC_INLINE uint32_t LL_I2C_GetTiming(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_REG(p_i2c->TIMINGR));
}

