MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i2c.h
/**
  * @brief  Get the timing Prescaler setting.
  * @rmtoll
  *  TIMINGR      PRESC         LL_I2C_GetTimingPrescaler
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0xF
  */
__STATIC_INLINE uint32_t LL_I2C_GetTimingPrescaler(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMINGR, I2C_TIMINGR_PRESC) >> I2C_TIMINGR_PRESC_Pos);
}

/**
  * @brief  Get the SCL low period setting.
  * @rmtoll
  *  TIMINGR      SCLL          LL_I2C_GetClockLowPeriod
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_I2C_GetClockLowPeriod(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMINGR, I2C_TIMINGR_SCLL) >> I2C_TIMINGR_SCLL_Pos);
}

/**
  * @brief  Get the SCL high period setting.
  * @rmtoll
  *  TIMINGR      SCLH          LL_I2C_GetClockHighPeriod
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_I2C_GetClockHighPeriod(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMINGR, I2C_TIMINGR_SCLH) >> I2C_TIMINGR_SCLH_Pos);
}

/**
  * @brief  Get the SDA hold time.
  * @rmtoll
  *  TIMINGR      SDADEL        LL_I2C_GetDataHoldTime
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0xF
  */
__STATIC_INLINE uint32_t LL_I2C_GetDataHoldTime(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMINGR, I2C_TIMINGR_SDADEL) >> I2C_TIMINGR_SDADEL_Pos);
}

/**
  * @brief  Get the SDA setup time.
  * @rmtoll
  *  TIMINGR      SCLDEL        LL_I2C_GetDataSetupTime
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0xF
  */
__STATIC_INLINE uint32_t LL_I2C_GetDataSetupTime(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMINGR, I2C_TIMINGR_SCLDEL) >> I2C_TIMINGR_SCLDEL_Pos);
}

/**
  * @brief  Configure peripheral mode.
  * @param  p_i2c I2C instance.
  * @param  peripheral_mode This parameter can be one of the following values:
  *         @arg @ref LL_I2C_MODE_I2C
  *         @arg @ref LL_I2C_MODE_SMBUS_HOST
  *         @arg @ref LL_I2C_MODE_SMBUS_SLAVE
  *         @arg @ref LL_I2C_MODE_SMBUS_SLAVE_ARP
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          SMBHEN        LL_I2C_SetMode \n
  *  CR1          SMBDEN        LL_I2C_SetMode
  */
__STATIC_INLINE void LL_I2C_SetMode(I2C_TypeDef *p_i2c, uint32_t peripheral_mode)
{
  STM32_MODIFY_REG(p_i2c->CR1, I2C_CR1_SMBHEN | I2C_CR1_SMBDEN, peripheral_mode);
}

/**
  * @brief  Get peripheral mode.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          SMBHEN        LL_I2C_GetMode \n
  *  CR1          SMBDEN        LL_I2C_GetMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_MODE_I2C
  *         @arg @ref LL_I2C_MODE_SMBUS_HOST
  *         @arg @ref LL_I2C_MODE_SMBUS_SLAVE
  *         @arg @ref LL_I2C_MODE_SMBUS_SLAVE_ARP
  */
__STATIC_INLINE uint32_t LL_I2C_GetMode(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->CR1, I2C_CR1_SMBHEN | I2C_CR1_SMBDEN));
}

/**
  * @brief  Enable SMBus alert (Host or Device mode).
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   SMBus Device mode:
  *         - SMBus Alert pin is drived low and
  *           Alert Response Address Header acknowledge is enabled.
  *         SMBus Host mode:
  *         - SMBus Alert pin management is supported.
  * @rmtoll
  *  CR1          ALERTEN       LL_I2C_EnableSMBusAlert
  */
__STATIC_INLINE void LL_I2C_EnableSMBusAlert(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_ALERTEN);
}

/**
  * @brief  Disable SMBus alert (Host or Device mode).
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   SMBus Device mode:
  *         - SMBus Alert pin is not drived (can be used as a standard GPIO) and
  *           Alert Response Address Header acknowledge is disabled.
  *         SMBus Host mode:
  *         - SMBus Alert pin management is not supported.
  * @rmtoll
  *  CR1          ALERTEN       LL_I2C_DisableSMBusAlert
  */
__STATIC_INLINE void LL_I2C_DisableSMBusAlert(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_ALERTEN);
}

/**
  * @brief  Check if SMBus alert (Host or Device mode) is enabled or disabled.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          ALERTEN       LL_I2C_IsEnabledSMBusAlert
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledSMBusAlert(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_ALERTEN) == (I2C_CR1_ALERTEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable SMBus Packet Error Calculation (PEC).
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          PECEN         LL_I2C_EnableSMBusPEC
  */
__STATIC_INLINE void LL_I2C_EnableSMBusPEC(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_PECEN);
}

/**
  * @brief  Disable SMBus Packet Error Calculation (PEC).
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          PECEN         LL_I2C_DisableSMBusPEC
  */
__STATIC_INLINE void LL_I2C_DisableSMBusPEC(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_PECEN);
}

/**
  * @brief  Check if SMBus Packet Error Calculation (PEC) is enabled or disabled.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR1          PECEN         LL_I2C_IsEnabledSMBusPEC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledSMBusPEC(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_PECEN) == (I2C_CR1_PECEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the SMBus Clock Timeout.
  * @param  p_i2c I2C instance.
  * @param  timeout_a This parameter must be a value between  Min_Data=0 and Max_Data=0xFFF.
  * @param  timeout_a_mode This parameter can be one of the following values:
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA_MODE_SCL_LOW
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA_MODE_SDA_SCL_HIGH
  * @param  timeout_b
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   This configuration can only be programmed when associated Timeout is disabled (timeout_a and/or timeout_b).
  * @rmtoll
  *  TIMEOUTR     TIMEOUTA      LL_I2C_ConfigSMBusTimeout \n
  *  TIMEOUTR     TIDLE         LL_I2C_ConfigSMBusTimeout \n
  *  TIMEOUTR     TIMEOUTB      LL_I2C_ConfigSMBusTimeout
  */
__STATIC_INLINE void LL_I2C_ConfigSMBusTimeout(I2C_TypeDef *p_i2c, uint32_t timeout_a, uint32_t timeout_a_mode,
                                               uint32_t timeout_b)
{
  STM32_MODIFY_REG(p_i2c->TIMEOUTR, I2C_TIMEOUTR_TIMEOUTA | I2C_TIMEOUTR_TIDLE | I2C_TIMEOUTR_TIMEOUTB,
                   timeout_a | timeout_a_mode | (timeout_b << I2C_TIMEOUTR_TIMEOUTB_Pos));
}

/**
  * @brief  Configure the SMBus Clock timeout_a (SCL low timeout or SCL and SDA high timeout depends on timeout_a mode).
  * @param  p_i2c I2C instance.
  * @param  timeout_a This parameter must be a value between  Min_Data=0 and Max_Data=0xFFF.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   These bits can only be programmed when timeout_a is disabled.
  * @rmtoll
  *  TIMEOUTR     TIMEOUTA      LL_I2C_SetSMBusTimeoutA
  */
__STATIC_INLINE void LL_I2C_SetSMBusTimeoutA(I2C_TypeDef *p_i2c, uint32_t timeout_a)
{
  STM32_WRITE_REG(p_i2c->TIMEOUTR, timeout_a);
}

/**
  * @brief  Get the SMBus Clock timeout_a setting.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  TIMEOUTR     TIMEOUTA      LL_I2C_GetSMBusTimeoutA
  * @retval Value between Min_Data=0 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t LL_I2C_GetSMBusTimeoutA(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMEOUTR, I2C_TIMEOUTR_TIMEOUTA));
}

/**
  * @brief  Set the SMBus Clock timeout_a mode.
  * @param  p_i2c I2C instance.
  * @param  timeout_a_mode This parameter can be one of the following values:
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA_MODE_SCL_LOW
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA_MODE_SDA_SCL_HIGH
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   This bit can only be programmed when timeout_a is disabled.
  * @rmtoll
  *  TIMEOUTR     TIDLE         LL_I2C_SetSMBusTimeoutAMode
  */
__STATIC_INLINE void LL_I2C_SetSMBusTimeoutAMode(I2C_TypeDef *p_i2c, uint32_t timeout_a_mode)
{
  STM32_WRITE_REG(p_i2c->TIMEOUTR, timeout_a_mode);
}

/**
  * @brief  Get the SMBus Clock timeout_a mode.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  TIMEOUTR     TIDLE         LL_I2C_GetSMBusTimeoutAMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA_MODE_SCL_LOW
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA_MODE_SDA_SCL_HIGH
  */
__STATIC_INLINE uint32_t LL_I2C_GetSMBusTimeoutAMode(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMEOUTR, I2C_TIMEOUTR_TIDLE));
}

/**
  * @brief  Configure the SMBus Extended Cumulative Clock timeout_b (Master or Slave mode).
  * @param  p_i2c I2C instance.
  * @param  timeout_b This parameter must be a value between  Min_Data=0 and Max_Data=0xFFF.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   These bits can only be programmed when timeout_b is disabled.
  * @rmtoll
  *  TIMEOUTR     TIMEOUTB      LL_I2C_SetSMBusTimeoutB
  */
__STATIC_INLINE void LL_I2C_SetSMBusTimeoutB(I2C_TypeDef *p_i2c, uint32_t timeout_b)
{
  STM32_WRITE_REG(p_i2c->TIMEOUTR, timeout_b << I2C_TIMEOUTR_TIMEOUTB_Pos);
}

/**
  * @brief  Get the SMBus Extended Cumulative Clock timeout_b setting.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  TIMEOUTR     TIMEOUTB      LL_I2C_GetSMBusTimeoutB
  * @retval Value between Min_Data=0 and Max_Data=0xFFF
  */
__STATIC_INLINE uint32_t LL_I2C_GetSMBusTimeoutB(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->TIMEOUTR, I2C_TIMEOUTR_TIMEOUTB) >> I2C_TIMEOUTR_TIMEOUTB_Pos);
}

/**
  * @brief  Enable the SMBus Clock Timeout.
  * @param  p_i2c I2C instance.
  * @param  clock_timeout This parameter can be one of the following values:
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTB
  *         @arg @ref LL_I2C_SMBUS_ALL_TIMEOUT
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  TIMEOUTR     TIMOUTEN      LL_I2C_EnableSMBusTimeout \n
  *  TIMEOUTR     TEXTEN        LL_I2C_EnableSMBusTimeout
  */
__STATIC_INLINE void LL_I2C_EnableSMBusTimeout(I2C_TypeDef *p_i2c, uint32_t clock_timeout)
{
  STM32_SET_BIT(p_i2c->TIMEOUTR, clock_timeout);
}

/**
  * @brief  Disable the SMBus Clock Timeout.
  * @param  p_i2c I2C instance.
  * @param  clock_timeout This parameter can be one of the following values:
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTB
  *         @arg @ref LL_I2C_SMBUS_ALL_TIMEOUT
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  TIMEOUTR     TIMOUTEN      LL_I2C_DisableSMBusTimeout \n
  *  TIMEOUTR     TEXTEN        LL_I2C_DisableSMBusTimeout
  */
__STATIC_INLINE void LL_I2C_DisableSMBusTimeout(I2C_TypeDef *p_i2c, uint32_t clock_timeout)
{
  STM32_CLEAR_BIT(p_i2c->TIMEOUTR, clock_timeout);
}

/**
  * @brief  Check if the SMBus Clock Timeout is enabled or disabled.
  * @param  p_i2c I2C instance.
  * @param  clock_timeout This parameter can be one of the following values:
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTA
  *         @arg @ref LL_I2C_SMBUS_TIMEOUTB
  *         @arg @ref LL_I2C_SMBUS_ALL_TIMEOUT
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  TIMEOUTR     TIMOUTEN      LL_I2C_IsEnabledSMBusTimeout \n
  *  TIMEOUTR     TEXTEN        LL_I2C_IsEnabledSMBusTimeout
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledSMBusTimeout(const I2C_TypeDef *p_i2c, uint32_t clock_timeout)
{
  return ((STM32_READ_BIT(p_i2c->TIMEOUTR, (I2C_TIMEOUTR_TIMOUTEN | I2C_TIMEOUTR_TEXTEN)) == \
           (clock_timeout)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup I2C_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable TXIS interrupt.
  * @rmtoll
  *  CR1          TXIE          LL_I2C_EnableIT_TX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableIT_TX(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_TXIE);
}

/**
  * @brief  Disable TXIS interrupt.
  * @rmtoll
  *  CR1          TXIE          LL_I2C_DisableIT_TX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableIT_TX(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_TXIE);
}

/**
  * @brief  Check if the TXIS Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          TXIE          LL_I2C_IsEnabledIT_TX
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT_TX(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_TXIE) == (I2C_CR1_TXIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable RXNE interrupt.
  * @rmtoll
  *  CR1          RXIE          LL_I2C_EnableIT_RX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableIT_RX(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_RXIE);
}

/**
  * @brief  Disable RXNE interrupt.
  * @rmtoll
  *  CR1          RXIE          LL_I2C_DisableIT_RX
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableIT_RX(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_RXIE);
}

/**
  * @brief  Check if the RXNE Interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          RXIE          LL_I2C_IsEnabledIT_RX
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT_RX(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_RXIE) == (I2C_CR1_RXIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Address match interrupt (slave mode only).
  * @rmtoll
  *  CR1          ADDRIE        LL_I2C_EnableIT_ADDR
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableIT_ADDR(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_ADDRIE);
}

/**
  * @brief  Disable Address match interrupt (slave mode only).
  * @rmtoll
  *  CR1          ADDRIE        LL_I2C_DisableIT_ADDR
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableIT_ADDR(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_ADDRIE);
}

/**
  * @brief  Check if Address match interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          ADDRIE        LL_I2C_IsEnabledIT_ADDR
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT_ADDR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_ADDRIE) == (I2C_CR1_ADDRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Not acknowledge received interrupt.
  * @rmtoll
  *  CR1          NACKIE        LL_I2C_EnableIT_NACK
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableIT_NACK(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_NACKIE);
}

/**
  * @brief  Disable Not acknowledge received interrupt.
  * @rmtoll
  *  CR1          NACKIE        LL_I2C_DisableIT_NACK
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableIT_NACK(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_NACKIE);
}

/**
  * @brief  Check if Not acknowledge received interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          NACKIE        LL_I2C_IsEnabledIT_NACK
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT_NACK(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_NACKIE) == (I2C_CR1_NACKIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable STOP detection interrupt.
  * @rmtoll
  *  CR1          STOPIE        LL_I2C_EnableIT_STOP
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_EnableIT_STOP(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_STOPIE);
}

/**
  * @brief  Disable STOP detection interrupt.
  * @rmtoll
  *  CR1          STOPIE        LL_I2C_DisableIT_STOP
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_DisableIT_STOP(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_STOPIE);
}

/**
  * @brief  Check if STOP detection interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          STOPIE        LL_I2C_IsEnabledIT_STOP
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT_STOP(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_STOPIE) == (I2C_CR1_STOPIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Transfer Complete interrupt.
  * @param  p_i2c I2C instance.
  * @note   Any of these events generates interrupt :
  *         Transfer Complete (TC)
  *         Transfer Complete Reload (TCR)
  * @rmtoll
  *  CR1          TCIE          LL_I2C_EnableIT_TC
  */
__STATIC_INLINE void LL_I2C_EnableIT_TC(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_TCIE);
}

/**
  * @brief  Disable Transfer Complete interrupt.
  * @param  p_i2c I2C instance.
  * @note   Any of these events generates interrupt :
  *         Transfer Complete (TC)
  *         Transfer Complete Reload (TCR)
  * @rmtoll
  *  CR1          TCIE          LL_I2C_DisableIT_TC
  */
__STATIC_INLINE void LL_I2C_DisableIT_TC(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_TCIE);
}

/**
  * @brief  Check if Transfer Complete interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          TCIE          LL_I2C_IsEnabledIT_TC
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT_TC(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_TCIE) == (I2C_CR1_TCIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Error interrupts.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   Any of these errors generates interrupt :
  *         Arbitration Loss (ARLO)
  *         Bus Error detection (BERR)
  *         Overrun/Underrun (OVR)
  *         SMBus Timeout detection (TIMEOUT)
  *         SMBus PEC error detection (PECERR)
  *         SMBus Alert pin event detection (ALERT)
  * @rmtoll
  *  CR1          ERRIE         LL_I2C_EnableIT_ERR
  */
__STATIC_INLINE void LL_I2C_EnableIT_ERR(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR1, I2C_CR1_ERRIE);
}

/**
  * @brief  Disable Error interrupts.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   Any of these errors generates interrupt :
  *         Arbitration Loss (ARLO)
  *         Bus Error detection (BERR)
  *         Overrun/Underrun (OVR)
  *         SMBus Timeout detection (TIMEOUT)
  *         SMBus PEC error detection (PECERR)
  *         SMBus Alert pin event detection (ALERT)
  * @rmtoll
  *  CR1          ERRIE         LL_I2C_DisableIT_ERR
  */
__STATIC_INLINE void LL_I2C_DisableIT_ERR(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR1, I2C_CR1_ERRIE);
}

/**
  * @brief  Check if Error interrupts are enabled or disabled.
  * @rmtoll
  *  CR1          ERRIE         LL_I2C_IsEnabledIT_ERR
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT_ERR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR1, I2C_CR1_ERRIE) == (I2C_CR1_ERRIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the specified I2C interrupts.
  * @rmtoll
  *  CR1  TXIE    LL_I2C_EnableIT \n
  *  CR1  RXIE    LL_I2C_EnableIT \n
  *  CR1  ADDRIE  LL_I2C_EnableIT \n
  *  CR1  NACKIE  LL_I2C_EnableIT \n
  *  CR1  STOPIE  LL_I2C_EnableIT \n
  *  CR1  TCIE    LL_I2C_EnableIT \n
  *  CR1  ERRIE   LL_I2C_EnableIT
  * @param  p_i2c I2C instance.
  * @param  mask Interrupt sources to enable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref LL_I2C_CR1_TXIE    I2C_CR1_TXIE    TX Interrupt disa
  *            @arg @ref LL_I2C_CR1_RXIE    I2C_CR1_RXIE    RX Interrupt enable
  *            @arg @ref LL_I2C_CR1_ADDRIE  I2C_CR1_ADDRIE  Address match Interrupt enable (slave only)
  *            @arg @ref LL_I2C_CR1_NACKIE  I2C_CR1_NACKIE  Not acknowledge received Interrupt enable
  *            @arg @ref LL_I2C_CR1_STOPIE  I2C_CR1_STOPIE  STOP detection Interrupt enable
  *            @arg @ref LL_I2C_CR1_TCIE    I2C_CR1_TCIE    Transfer Complete interrupt enable
  *            @arg @ref LL_I2C_CR1_ERRIE   I2C_CR1_ERRIE   Error interrupts enable
  */
__STATIC_INLINE void LL_I2C_EnableIT(I2C_TypeDef *p_i2c, uint32_t mask)
{
  STM32_SET_BIT(p_i2c->CR1, mask);
}

