MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i2c.h
/**
  * @brief  Disable the specified I2C interrupts.
  * @rmtoll
  *  CR1  TXIE    LL_I2C_DisableIT \n
  *  CR1  RXIE    LL_I2C_DisableIT \n
  *  CR1  ADDRIE  LL_I2C_DisableIT \n
  *  CR1  NACKIE  LL_I2C_DisableIT \n
  *  CR1  STOPIE  LL_I2C_DisableIT \n
  *  CR1  TCIE    LL_I2C_DisableIT \n
  *  CR1  ERRIE   LL_I2C_DisableIT
  * @param  p_i2c I2C instance.
  * @param  mask Interrupt sources to disable.
  *         This parameter can be a combination of the following values:
  *            @arg @ref LL_I2C_CR1_TXIE    I2C_CR1_TXIE    TX Interrupt enable
  *            @arg @ref LL_I2C_CR1_RXIE    I2C_CR1_RXIE    RX Interrupt enable
  *            @arg @ref LL_I2C_CR1_ADDRIE  I2C_CR1_ADDRIE  Address match Interrupt enable (slave only)
  *            @arg @ref LL_I2C_CR1_NACKIE  I2C_CR1_NACKIE  Not acknowledge received Interrupt enable
  *            @arg @ref LL_I2C_CR1_STOPIE  I2C_CR1_STOPIE  STOP detection Interrupt enable
  *            @arg @ref LL_I2C_CR1_TCIE    I2C_CR1_TCIE    Transfer Complete interrupt enable
  *            @arg @ref LL_I2C_CR1_ERRIE   I2C_CR1_ERRIE   Error interrupts enable
  */
__STATIC_INLINE void LL_I2C_DisableIT(I2C_TypeDef *p_i2c, uint32_t mask)
{
  STM32_CLEAR_BIT(p_i2c->CR1, mask);
}

/**
  * @brief  Check whether the specified I2C interrupts sources are enabled or not.
  * @rmtoll
  *  CR1  TXIE    LL_I2C_IsEnabledIT \n
  *  CR1  RXIE    LL_I2C_IsEnabledIT \n
  *  CR1  ADDRIE  LL_I2C_IsEnabledIT \n
  *  CR1  NACKIE  LL_I2C_IsEnabledIT \n
  *  CR1  STOPIE  LL_I2C_IsEnabledIT \n
  *  CR1  TCIE    LL_I2C_IsEnabledIT \n
  *  CR1  ERRIE   LL_I2C_IsEnabledIT
  * @param  p_i2c I2C instance.
  * @param  mask Interrupts sources to check.
  *         This parameter can be a combination of the following values:
  *            @arg @ref LL_I2C_CR1_TXIE    I2C_CR1_TXIE    TX Interrupt enable
  *            @arg @ref LL_I2C_CR1_RXIE    I2C_CR1_RXIE    RX Interrupt enable
  *            @arg @ref LL_I2C_CR1_ADDRIE  I2C_CR1_ADDRIE  Address match Interrupt enable (slave only)
  *            @arg @ref LL_I2C_CR1_NACKIE  I2C_CR1_NACKIE  Not acknowledge received Interrupt enable
  *            @arg @ref LL_I2C_CR1_STOPIE  I2C_CR1_STOPIE  STOP detection Interrupt enable
  *            @arg @ref LL_I2C_CR1_TCIE    I2C_CR1_TCIE    Transfer Complete interrupt enable
  *            @arg @ref LL_I2C_CR1_ERRIE   I2C_CR1_ERRIE   Error interrupts enable
  * @retval State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledIT(const I2C_TypeDef *p_i2c, uint32_t mask)
{
  return ((STM32_READ_BIT(p_i2c->CR1, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup I2C_LL_EF_FLAG_management FLAG_management
  * @{
  */

/**
  * @brief  Indicate the status of a mask of flags.
  * @rmtoll
  *  ISR    I2C_ISR_TXE      LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_TXIS     LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_RXNE     LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_ADDR     LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_NACKF    LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_STOPF    LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_TC       LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_TCR      LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_BERR     LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_ARLO     LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_OVR      LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_PECERR   LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_TIMEOUT  LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_ALERT    LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_BUSY     LL_I2C_IsActiveFlag  \n
  *  ISR    I2C_ISR_DIR      LL_I2C_IsActiveFlag
  * @param  p_i2c I2C instance.
  * @param  mask Interrupts sources to check.
  *         This parameter can be a combination of the following values:
  *            @arg @ref  LL_I2C_ISR_TXE      I2C_ISR_TXE      Transmit data register empty
  *            @arg @ref  LL_I2C_ISR_TXIS     I2C_ISR_TXIS     Transmit interrupt status
  *            @arg @ref  LL_I2C_ISR_RXNE     I2C_ISR_RXNE     Receive data register not empty
  *            @arg @ref  LL_I2C_ISR_ADDR     I2C_ISR_ADDR     Address matched (slave mode)
  *            @arg @ref  LL_I2C_ISR_NACKF    I2C_ISR_NACKF    Not Acknowledge received flag
  *            @arg @ref  LL_I2C_ISR_STOPF    I2C_ISR_STOPF    Stop detection flag
  *            @arg @ref  LL_I2C_ISR_TC       I2C_ISR_TC       Transfer Complete (master mode)
  *            @arg @ref  LL_I2C_ISR_TCR      I2C_ISR_TCR      Transfer Complete Reload
  *            @arg @ref  LL_I2C_ISR_BERR     I2C_ISR_BERR     Bus error
  *            @arg @ref  LL_I2C_ISR_ARLO     I2C_ISR_ARLO     Arbitration lost
  *            @arg @ref  LL_I2C_ISR_OVR      I2C_ISR_OVR      Overrun/Underrun (slave mode)
  *            @arg @ref  LL_I2C_ISR_PECERR   I2C_ISR_PECERR   PEC Error in reception (SMBus mode)
  *            @arg @ref  LL_I2C_ISR_TIMEOUT  I2C_ISR_TIMEOUT  Timeout detection flag (SMBus mode)
  *            @arg @ref  LL_I2C_ISR_ALERT    I2C_ISR_ALERT    SMBus alert (SMBus mode)
  *            @arg @ref  LL_I2C_ISR_BUSY     I2C_ISR_BUSY     Bus busy
  *            @arg @ref  LL_I2C_ISR_DIR      I2C_ISR_DIR      Direction
  * @retval State of interrupts sources (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag(const I2C_TypeDef *p_i2c, uint32_t mask)
{
  return ((STM32_READ_BIT(p_i2c->ISR, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Transmit data register empty flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: When next data is written in Transmit data register.
  *         SET: When Transmit data register is empty.
  * @rmtoll
  *  ISR          TXE           LL_I2C_IsActiveFlag_TXE
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_TXE(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_TXE) == (I2C_ISR_TXE)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Transmit interrupt flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: When next data is written in Transmit data register.
  *         SET: When Transmit data register is empty.
  * @rmtoll
  *  ISR          TXIS          LL_I2C_IsActiveFlag_TXIS
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_TXIS(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_TXIS) == (I2C_ISR_TXIS)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Receive data register not empty flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: When Receive data register is read.
  *         SET: When the received data is copied in Receive data register.
  * @rmtoll
  *  ISR          RXNE          LL_I2C_IsActiveFlag_RXNE
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_RXNE(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_RXNE) == (I2C_ISR_RXNE)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Address matched flag (slave mode).
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When the received slave address matched with one of the enabled slave address.
  * @rmtoll
  *  ISR          ADDR          LL_I2C_IsActiveFlag_ADDR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_ADDR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_ADDR) == (I2C_ISR_ADDR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Not Acknowledge received flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When a NACK is received after a byte transmission.
  * @rmtoll
  *  ISR          NACKF         LL_I2C_IsActiveFlag_NACK
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_NACK(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_NACKF) == (I2C_ISR_NACKF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Stop detection flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When a Stop condition is detected.
  * @rmtoll
  *  ISR          STOPF         LL_I2C_IsActiveFlag_STOP
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_STOP(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_STOPF) == (I2C_ISR_STOPF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Transfer complete flag (master mode).
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When RELOAD=0, AUTOEND=0 and NBYTES date have been transferred.
  * @rmtoll
  *  ISR          TC            LL_I2C_IsActiveFlag_TC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_TC(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_TC) == (I2C_ISR_TC)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Transfer complete flag (master mode).
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When RELOAD=1 and NBYTES date have been transferred.
  * @rmtoll
  *  ISR          TCR           LL_I2C_IsActiveFlag_TCR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_TCR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_TCR) == (I2C_ISR_TCR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Bus error flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When a misplaced Start or Stop condition is detected.
  * @rmtoll
  *  ISR          BERR          LL_I2C_IsActiveFlag_BERR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_BERR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_BERR) == (I2C_ISR_BERR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Arbitration lost flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When arbitration lost.
  * @rmtoll
  *  ISR          ARLO          LL_I2C_IsActiveFlag_ARLO
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_ARLO(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_ARLO) == (I2C_ISR_ARLO)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Overrun/Underrun flag (slave mode).
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When an overrun/underrun error occurs (Clock Stretching Disabled).
  * @rmtoll
  *  ISR          OVR           LL_I2C_IsActiveFlag_OVR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_OVR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_OVR) == (I2C_ISR_OVR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of SMBus PEC error flag in reception.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   RESET: Clear default value.
  *         SET: When the received PEC does not match with the PEC register content.
  * @rmtoll
  *  ISR          PECERR        LL_I2C_IsActiveSMBusFlag_PECERR
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveSMBusFlag_PECERR(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_PECERR) == (I2C_ISR_PECERR)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of SMBus Timeout detection flag.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   RESET: Clear default value.
  *         SET: When a timeout or extended clock timeout occurs.
  * @rmtoll
  *  ISR          TIMEOUT       LL_I2C_IsActiveSMBusFlag_TIMEOUT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveSMBusFlag_TIMEOUT(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_TIMEOUT) == (I2C_ISR_TIMEOUT)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of SMBus alert flag.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   RESET: Clear default value.
  *         SET: When SMBus host configuration, SMBus alert enabled and
  *              a falling edge event occurs on SMBA pin.
  * @rmtoll
  *  ISR          ALERT         LL_I2C_IsActiveSMBusFlag_ALERT
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveSMBusFlag_ALERT(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_ALERT) == (I2C_ISR_ALERT)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate the status of Bus Busy flag.
  * @param  p_i2c I2C instance.
  * @note   RESET: Clear default value.
  *         SET: When a Start condition is detected.
  * @rmtoll
  *  ISR          BUSY          LL_I2C_IsActiveFlag_BUSY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsActiveFlag_BUSY(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->ISR, I2C_ISR_BUSY) == (I2C_ISR_BUSY)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Address Matched flag.
  * @rmtoll
  *  ICR          ADDRCF        LL_I2C_ClearFlag_ADDR
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_ClearFlag_ADDR(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_ADDRCF);
}

/**
  * @brief  Clear Not Acknowledge flag.
  * @rmtoll
  *  ICR          NACKCF        LL_I2C_ClearFlag_NACK
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_ClearFlag_NACK(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_NACKCF);
}

/**
  * @brief  Clear Stop detection flag.
  * @rmtoll
  *  ICR          STOPCF        LL_I2C_ClearFlag_STOP
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_ClearFlag_STOP(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_STOPCF);
}

/**
  * @brief  Clear Transmit data register empty flag (TXE).
  * @param  p_i2c I2C instance.
  * @note   This bit can be clear by software in order to flush the transmit data register (TXDR).
  * @rmtoll
  *  ISR          TXE           LL_I2C_ClearFlag_TXE
  */
__STATIC_INLINE void LL_I2C_ClearFlag_TXE(I2C_TypeDef *p_i2c)
{
  STM32_WRITE_REG(p_i2c->ISR, I2C_ISR_TXE);
}

/**
  * @brief  Clear Bus error flag.
  * @rmtoll
  *  ICR          BERRCF        LL_I2C_ClearFlag_BERR
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_ClearFlag_BERR(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_BERRCF);
}

/**
  * @brief  Clear Arbitration lost flag.
  * @rmtoll
  *  ICR          ARLOCF        LL_I2C_ClearFlag_ARLO
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_ClearFlag_ARLO(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_ARLOCF);
}

/**
  * @brief  Clear Overrun/Underrun flag.
  * @rmtoll
  *  ICR          OVRCF         LL_I2C_ClearFlag_OVR
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_ClearFlag_OVR(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_OVRCF);
}

/**
  * @brief  Clear SMBus PEC error flag.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  ICR          PECCF         LL_I2C_ClearSMBusFlag_PECERR
  */
__STATIC_INLINE void LL_I2C_ClearSMBusFlag_PECERR(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_PECCF);
}

/**
  * @brief  Clear SMBus Timeout detection flag.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  ICR          TIMOUTCF      LL_I2C_ClearSMBusFlag_TIMEOUT
  */
__STATIC_INLINE void LL_I2C_ClearSMBusFlag_TIMEOUT(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_TIMOUTCF);
}

/**
  * @brief  Clear SMBus Alert flag.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  ICR          ALERTCF       LL_I2C_ClearSMBusFlag_ALERT
  */
__STATIC_INLINE void LL_I2C_ClearSMBusFlag_ALERT(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->ICR, I2C_ICR_ALERTCF);
}

/**
  * @}
  */

/** @defgroup I2C_LL_EF_Data_Management Data_Management
  * @{
  */

/**
  * @brief  Enable automatic STOP condition generation (master mode).
  * @param  p_i2c I2C instance.
  * @note   Automatic end mode : a STOP condition is automatically sent when NBYTES data are transferred.
  *         This bit has no effect in slave mode or when RELOAD bit is set.
  * @rmtoll
  *  CR2          AUTOEND       LL_I2C_EnableAutoEndMode
  */
__STATIC_INLINE void LL_I2C_EnableAutoEndMode(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR2, I2C_CR2_AUTOEND);
}

/**
  * @brief  Disable automatic STOP condition generation (master mode).
  * @param  p_i2c I2C instance.
  * @note   Software end mode : TC flag is set when NBYTES data are transferre, stretching SCL low.
  * @rmtoll
  *  CR2          AUTOEND       LL_I2C_DisableAutoEndMode
  */
__STATIC_INLINE void LL_I2C_DisableAutoEndMode(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR2, I2C_CR2_AUTOEND);
}

/**
  * @brief  Check if automatic STOP condition is enabled or disabled.
  * @rmtoll
  *  CR2          AUTOEND       LL_I2C_IsEnabledAutoEndMode
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledAutoEndMode(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR2, I2C_CR2_AUTOEND) == (I2C_CR2_AUTOEND)) ? 1UL : 0UL);
}

/**
  * @brief  Enable reload mode (master mode).
  * @param  p_i2c I2C instance.
  * @note   The transfer is not completed after the NBYTES data transfer, NBYTES is reloaded when TCR flag is set.
  * @rmtoll
  *  CR2          RELOAD       LL_I2C_EnableReloadMode
  */
__STATIC_INLINE void LL_I2C_EnableReloadMode(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR2, I2C_CR2_RELOAD);
}

/**
  * @brief  Disable reload mode (master mode).
  * @param  p_i2c I2C instance.
  * @note   The transfer is completed after the NBYTES data transfer(STOP or RESTART follows).
  * @rmtoll
  *  CR2          RELOAD       LL_I2C_DisableReloadMode
  */
__STATIC_INLINE void LL_I2C_DisableReloadMode(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR2, I2C_CR2_RELOAD);
}

/**
  * @brief  Check if reload mode is enabled or disabled.
  * @rmtoll
  *  CR2          RELOAD       LL_I2C_IsEnabledReloadMode
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledReloadMode(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR2, I2C_CR2_RELOAD) == (I2C_CR2_RELOAD)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the number of bytes for transfer.
  * @param  p_i2c I2C instance.
  * @param  xfer_size This parameter must be a value between Min_Data=0x00 and Max_Data=0xFF.
  * @note   Changing these bits when START bit is set is not allowed.
  * @rmtoll
  *  CR2          NBYTES           LL_I2C_SetTransferSize
  */
__STATIC_INLINE void LL_I2C_SetTransferSize(I2C_TypeDef *p_i2c, uint32_t xfer_size)
{
  STM32_MODIFY_REG(p_i2c->CR2, I2C_CR2_NBYTES, xfer_size << I2C_CR2_NBYTES_Pos);
}

/**
  * @brief  Get the number of bytes configured for transfer.
  * @rmtoll
  *  CR2          NBYTES           LL_I2C_GetTransferSize
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_I2C_GetTransferSize(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->CR2, I2C_CR2_NBYTES) >> I2C_CR2_NBYTES_Pos);
}

/**
  * @brief  Prepare the generation of a ACKnowledge or Non ACKnowledge condition after the address receive match code.
            or next received byte.
  * @param  p_i2c I2C instance.
  * @param  type_acknowledge This parameter can be one of the following values:
  *         @arg @ref LL_I2C_ACK
  *         @arg @ref LL_I2C_NACK
  * @note   Usage in Slave mode only.
  * @rmtoll
  *  CR2          NACK          LL_I2C_AcknowledgeNextData
  */
__STATIC_INLINE void LL_I2C_AcknowledgeNextData(I2C_TypeDef *p_i2c, uint32_t type_acknowledge)
{
  STM32_MODIFY_REG(p_i2c->CR2, I2C_CR2_NACK, type_acknowledge);
}

/**
  * @brief  Disable Address Acknowledge.
  * @rmtoll
  *  CR2          NACK          LL_I2C_AcknowledgeNextData
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_AcknowledgeDisable(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR2, I2C_CR2_NACK);
}

/**
  * @brief  Enable Address Acknowledge.
  * @rmtoll
  *  CR2          NACK          LL_I2C_AcknowledgeEnable
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_AcknowledgeEnable(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR2, I2C_CR2_NACK);
}

/**
  * @brief  Generate a START or RESTART condition.
  * @param  p_i2c I2C instance.
  * @note   The START bit can be set even if bus is BUSY or I2C is in slave mode.
  *         This action has no effect when RELOAD is set.
  * @rmtoll
  *  CR2          START           LL_I2C_GenerateStartCondition
  */
__STATIC_INLINE void LL_I2C_GenerateStartCondition(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR2, I2C_CR2_START);
}

/**
  * @brief  Generate a STOP condition after the current byte transfer (master mode).
  * @rmtoll
  *  CR2          STOP          LL_I2C_GenerateStopCondition
  * @param  p_i2c I2C instance.
  */
__STATIC_INLINE void LL_I2C_GenerateStopCondition(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR2, I2C_CR2_STOP);
}

/**
  * @brief  Enable automatic RESTART Read request condition for 10bit address header (master mode).
  * @param  p_i2c I2C instance.
  * @note   The master sends the complete 10bit slave address read sequence :
  *         Start + 2 bytes 10bit address in Write direction + Restart + first 7 bits of 10bit address
            in Read direction.
  * @rmtoll
  *  CR2          HEAD10R       LL_I2C_EnableAuto10BitRead
  */
__STATIC_INLINE void LL_I2C_EnableAuto10BitRead(I2C_TypeDef *p_i2c)
{
  STM32_CLEAR_BIT(p_i2c->CR2, I2C_CR2_HEAD10R);
}

/**
  * @brief  Disable automatic RESTART Read request condition for 10bit address header (master mode).
  * @param  p_i2c I2C instance.
  * @note   The master only sends the first 7 bits of 10bit address in Read direction.
  * @rmtoll
  *  CR2          HEAD10R       LL_I2C_DisableAuto10BitRead
  */
__STATIC_INLINE void LL_I2C_DisableAuto10BitRead(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR2, I2C_CR2_HEAD10R);
}

/**
  * @brief  Check if automatic RESTART Read request condition for 10bit address header is enabled or disabled.
  * @rmtoll
  *  CR2          HEAD10R       LL_I2C_IsEnabledAuto10BitRead
  * @param  p_i2c I2C instance.
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledAuto10BitRead(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR2, I2C_CR2_HEAD10R) != (I2C_CR2_HEAD10R)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the transfer direction (master mode).
  * @param  p_i2c I2C instance.
  * @param  xfer_request This parameter can be one of the following values:
  *         @arg @ref LL_I2C_REQUEST_WRITE
  *         @arg @ref LL_I2C_REQUEST_READ
  * @note   Changing these bits when START bit is set is not allowed.
  * @rmtoll
  *  CR2          RD_WRN           LL_I2C_SetTransferRequest
  */
__STATIC_INLINE void LL_I2C_SetTransferRequest(I2C_TypeDef *p_i2c, uint32_t xfer_request)
{
  STM32_MODIFY_REG(p_i2c->CR2, I2C_CR2_RD_WRN, xfer_request);
}

