MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_i2c.h
/**
  * @brief  Get the transfer direction requested (master mode).
  * @rmtoll
  *  CR2          RD_WRN           LL_I2C_GetTransferRequest
  * @param  p_i2c I2C instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_REQUEST_WRITE
  *         @arg @ref LL_I2C_REQUEST_READ
  */
__STATIC_INLINE uint32_t LL_I2C_GetTransferRequest(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->CR2, I2C_CR2_RD_WRN));
}

/**
  * @brief  Configure the slave address for transfer (master mode).
  * @param  p_i2c I2C instance.
  * @param  slave_addr This parameter must be a value between Min_Data=0x00 and Max_Data=0x3F.
  * @note   Changing these bits when START bit is set is not allowed.
  * @rmtoll
  *  CR2          SADD           LL_I2C_SetSlaveAddr
  */
__STATIC_INLINE void LL_I2C_SetSlaveAddr(I2C_TypeDef *p_i2c, uint32_t slave_addr)
{
  STM32_MODIFY_REG(p_i2c->CR2, I2C_CR2_SADD, slave_addr);
}

/**
  * @brief  Get the slave address programmed for transfer.
  * @rmtoll
  *  CR2          SADD           LL_I2C_GetSlaveAddr
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x0 and Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_I2C_GetSlaveAddr(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->CR2, I2C_CR2_SADD));
}

/**
  * @brief  Handles p_i2c communication when starting transfer or during transfer (TC or TCR flag are set).
  * @rmtoll
  *  CR2          SADD          LL_I2C_HandleTransfer \n
  *  CR2          ADD10         LL_I2C_HandleTransfer \n
  *  CR2          RD_WRN        LL_I2C_HandleTransfer \n
  *  CR2          START         LL_I2C_HandleTransfer \n
  *  CR2          STOP          LL_I2C_HandleTransfer \n
  *  CR2          RELOAD        LL_I2C_HandleTransfer \n
  *  CR2          NBYTES        LL_I2C_HandleTransfer \n
  *  CR2          AUTOEND       LL_I2C_HandleTransfer \n
  *  CR2          HEAD10R       LL_I2C_HandleTransfer
  * @param  p_i2c I2C instance.
  * @param  slave_addr Specifies the slave address to be programmed.
  * @param  slave_addr_size This parameter can be one of the following values:
  *         @arg @ref LL_I2C_ADDRSLAVE_7BIT
  *         @arg @ref LL_I2C_ADDRSLAVE_10BIT
  * @param  xfer_size Specifies the number of bytes to be programmed.
  *                       This parameter must be a value between Min_Data=0 and Max_Data=255.
  * @param  end_mode This parameter can be one of the following values:
  *         @arg @ref LL_I2C_MODE_RELOAD
  *         @arg @ref LL_I2C_MODE_AUTOEND
  *         @arg @ref LL_I2C_MODE_SOFTEND
  *         @arg @ref LL_I2C_MODE_SMBUS_RELOAD
  *         @arg @ref LL_I2C_MODE_SMBUS_AUTOEND_NO_PEC
  *         @arg @ref LL_I2C_MODE_SMBUS_SOFTEND_NO_PEC
  *         @arg @ref LL_I2C_MODE_SMBUS_AUTOEND_WITH_PEC
  *         @arg @ref LL_I2C_MODE_SMBUS_SOFTEND_WITH_PEC
  * @param  request This parameter can be one of the following values:
  *         @arg @ref LL_I2C_GENERATE_NOSTARTSTOP
  *         @arg @ref LL_I2C_GENERATE_STOP
  *         @arg @ref LL_I2C_GENERATE_START_READ
  *         @arg @ref LL_I2C_GENERATE_START_WRITE
  *         @arg @ref LL_I2C_GENERATE_RESTART_7BIT_READ
  *         @arg @ref LL_I2C_GENERATE_RESTART_7BIT_WRITE
  *         @arg @ref LL_I2C_GENERATE_RESTART_10BIT_READ
  *         @arg @ref LL_I2C_GENERATE_RESTART_10BIT_WRITE
  */
__STATIC_INLINE void LL_I2C_HandleTransfer(I2C_TypeDef *p_i2c, uint32_t slave_addr, uint32_t slave_addr_size,
                                           uint32_t xfer_size, uint32_t end_mode, uint32_t request)
{
  STM32_MODIFY_REG(p_i2c->CR2, I2C_CR2_SADD | I2C_CR2_ADD10 |
                   (I2C_CR2_RD_WRN & (uint32_t)(request >> (31U - I2C_CR2_RD_WRN_Pos))) |
                   I2C_CR2_START | I2C_CR2_STOP | I2C_CR2_RELOAD |
                   I2C_CR2_NBYTES | I2C_CR2_AUTOEND | I2C_CR2_HEAD10R,
                   slave_addr | slave_addr_size | (xfer_size << I2C_CR2_NBYTES_Pos) | end_mode | request);
}

/**
  * @brief  Indicate the value of transfer direction (slave mode).
  * @param  p_i2c I2C instance.
  * @note   RESET: Write transfer, Slave enters in receiver mode.
  *         SET: Read transfer, Slave enters in transmitter mode.
  * @rmtoll
  *  ISR          DIR           LL_I2C_GetTransferDirection
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_I2C_DIRECTION_WRITE
  *         @arg @ref LL_I2C_DIRECTION_READ
  */
__STATIC_INLINE uint32_t LL_I2C_GetTransferDirection(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->ISR, I2C_ISR_DIR));
}

/**
  * @brief  Return the slave matched address.
  * @rmtoll
  *  ISR          ADDCODE       LL_I2C_GetAddressMatchCode
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x00 and Max_Data=0x3F
  */
__STATIC_INLINE uint32_t LL_I2C_GetAddressMatchCode(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->ISR, I2C_ISR_ADDCODE) >> I2C_ISR_ADDCODE_Pos << 1);
}

/**
  * @brief  Enable internal comparison of the SMBus Packet Error byte (transmission or reception mode).
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @note   This feature is cleared by hardware when the PEC byte is transferred, or when a STOP condition
            or an Address Matched is received.
  *         This bit has no effect when RELOAD bit is set.
  *         This bit has no effect in device mode when SBC bit is not set.
  * @rmtoll
  *  CR2          PECBYTE       LL_I2C_EnableSMBusPECCompare
  */
__STATIC_INLINE void LL_I2C_EnableSMBusPECCompare(I2C_TypeDef *p_i2c)
{
  STM32_SET_BIT(p_i2c->CR2, I2C_CR2_PECBYTE);
}

/**
  * @brief  Check if the SMBus Packet Error byte internal comparison is requested or not.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  CR2          PECBYTE       LL_I2C_IsEnabledSMBusPECCompare
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_I2C_IsEnabledSMBusPECCompare(const I2C_TypeDef *p_i2c)
{
  return ((STM32_READ_BIT(p_i2c->CR2, I2C_CR2_PECBYTE) == (I2C_CR2_PECBYTE)) ? 1UL : 0UL);
}

/**
  * @brief  Get the SMBus Packet Error byte calculated.
  * @param  p_i2c I2C instance.
  * @note   The macro IS_SMBUS_ALL_INSTANCE(p_i2c) can be used to check whether or not
  *         SMBus feature is supported by the p_i2c instance.
  * @rmtoll
  *  PECR         PEC           LL_I2C_GetSMBusPEC
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint32_t LL_I2C_GetSMBusPEC(const I2C_TypeDef *p_i2c)
{
  return (uint32_t)(STM32_READ_BIT(p_i2c->PECR, I2C_PECR_PEC));
}

/**
  * @brief  Read Receive data register.
  * @rmtoll
  *  RXDR         RXDATA        LL_I2C_ReceiveData8
  * @param  p_i2c I2C instance.
  * @retval Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE uint8_t LL_I2C_ReceiveData8(const I2C_TypeDef *p_i2c)
{
  return (uint8_t)(STM32_READ_REG(p_i2c->RXDR));
}

/**
  * @brief  Write in Transmit data Register .
  * @rmtoll
  *  TXDR         TXDATA        LL_I2C_TransmitData8
  * @param  p_i2c I2C instance.
  * @param  data Value between Min_Data=0x00 and Max_Data=0xFF
  */
__STATIC_INLINE void LL_I2C_TransmitData8(I2C_TypeDef *p_i2c, uint8_t data)
{
  STM32_WRITE_REG(p_i2c->TXDR, data);
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* I2C1 || I2C2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5xx_LL_I2C_H */
